#region Russian

/*

ГЛАВА 1

СОЗДАНИЕ C#

C# является основным языком разработки программ на платформе .NET корпорации
Microsoft. В нем удачно сочетаются испытанные средства программирования с самыми 
последними новшествами и предоставляется возможность для эффективного
и очень практичного написания программ, предназначенных для вычислительной среды 
современных предприятий. Это, без сомнения, один из самых важных языков программирования
XXI века.

Назначение этой главы — представить C# в его историческом контексте, упомянув 
и те движущие силы, которые способствовали его созданию, выработке его конструктивных
особенностей и определили его влияние на другие языки программирования. Кроме того, 
в этой главе поясняется взаимосвязь С# со средой .NET Framework. Как станет ясно
из дальнейшего материала, C# и .NET Framework совместно образуют весьма изящную среду 
программирования.

Генеалогическое дерево C#

Языки программирования не существуют в пустоте. Напротив, они тесно связаны
друг с другом таким образом, что на каждый новый язык оказывают в той или иной
форме влияние его предшественники. Этот процесс сродни перекрестному опылению,
в ходе которого свойства одного языка приспосабливаются к другому языку, полезные
нововведения внедряются в существующий контекст, а устаревшие конструкции удаляются.
Таким путем развиваются языки программирования и совершенствуется искусство
программирования. И в этом отношении C# не является исключением.

У языка программирования C# "богатое наследство". Он является прямым наследником
двух самых удачных языков программирования: С и C++. Он также имеет тесные
родственные связи с еще одним языком: Java. Ясное представление об этих взаимосвязях
имеет решающее значение для понимания С#. Поэтому сначала определим, какое
место занимает C# среди этих трех языков.

Язык С - начало современной эпохи программирования

Создание С знаменует собой начало современной эпохи программирования. Язык
С был разработан Деннисом Ритчи (Dennis Ritchie) в 1970-е годы для программирования
на мини-ЭВМ DEC PDP-11 под управлением операционной системы Unix. Несмотря
на то что в ряде предшествовавших языков, в особенности Pascal, был достигнут
значительный прогресс, именно С установил тот образец, которому до сих пор следуют
в программировании.

Язык С появился в результате революции в структурном программировании
в 1960-е годы. До появления структурного программирования писать большие программы
было трудно, поскольку логика программы постепенно вырождалась в так называемый
"макаронный" код — запутанный клубок безусловных переходов, вызовов и
возвратов, которые трудно отследить. В структурированных языках программирования
этот недостаток устранялся путем ввода строго определенных управляющих операторов,
подпрограмм с локальными переменными и других усовершенствований. Благодаря
применению методов структурного программирования сами программы стали
более организованными, надежными и управляемыми.

И хотя в то время существовали и другие структурированные языки программирования,
именно в С впервые удалось добиться удачного сочетания эффективности,
изящества и выразительности. Благодаря своему краткому, но простому синтаксису
в сочетании с принципом, ставившим во главу угла программиста, а не сам язык, С быстро
завоевал многих сторонников. Сейчас уже нелегко представить себе, что С оказался
своего рода "струей свежего воздуха", которого так не хватало программистам.
В итоге С стал самым распространенным языком структурного программирования
в 1980-е годы.

Но даже у такого достойного языка, как С, имелись свои ограничения. К числу самых
труднопреодолимых его ограничений относится неспособность справиться с большими
программами. Как только проект достигает определенного масштаба, язык С
тут же ставит предел, затрудняющий понимание и сопровождение программ при их
последующем разрастании. Конкретный предел зависит от самой программы, программиста
и применяемых инструментальных средств, тем не менее, всегда существует
"порог", за которым программа на С становится неуправляемой.

*/

#endregion